## Plan for terraform
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 2 to change, 10 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ca-central-1:283582579564:service/sre-bot-cluster/sre-bot-service"
        name                               = "sre-bot-service"
        tags                               = {
            "CostCentre" = "sre-bot"
        }
      ~ task_definition                    = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:10" -> (known after apply)
        # (14 unchanged attributes hidden)




        # (4 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.sre-bot must be replaced
-/+ resource "aws_ecs_task_definition" "sre-bot" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:283582579564:task-definition/sre-bot-task:10" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - environment      = [
                      - {
                          - name  = "INCIDENT_CHANNEL"
                          - value = "CUYR73ESX"
                        },
                      - {
                          - name  = "INCIDENT_LIST"
                          - value = "16LyYJNzy4ccoTAXSLuNf53iI6nE1a94WlXkSI8rIgOg"
                        },
                      - {
                          - name  = "INCIDENT_TEMPLATE"
                          - value = "1Nb9Zh0OR2HulVtpqDpFnRTcq6VwsWSaKK9QS3Y6o0TE"
                        },
                      - {
                          - name  = "SRE_DRIVE_ID"
                          - value = "0AIDSjTWDkyPxUk9PVA"
                        },
                      - {
                          - name  = "SRE_INCIDENT_FOLDER"
                          - value = "13CqZaprwAqebkrcFnOdwkAt3JT4Fs2It"
                        },
                    ] -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8000 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "sre-bot-task" -> (known after apply)
      ~ revision                 = 10 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # aws_iam_policy.sre-bot_secrets_manager will be updated in-place
  ~ resource "aws_iam_policy" "sre-bot_secrets_manager" {
        id        = "arn:aws:iam::283582579564:policy/sre-botSecretsManagerKeyRetrieval"
        name      = "sre-botSecretsManagerKeyRetrieval"
      ~ policy    = jsonencode(
          ~ {
              ~ Statement = [
                  - {
                      - Action   = "secretsmanager:GetSecretValue"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH",
                          - "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51",
                          - "arn:aws:secretsmanager:ca-central-1:283582579564:secret:opsgenie-key-144676-vBx1r2",
                          - "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH",
                        ]
                      - Sid      = ""
                    },
                    {
                        Action   = "ssm:GetParameters"
                        Effect   = "Allow"
                        Resource = "arn:aws:ssm:ca-central-1:283582579564:parameter/sre-bot-config"
                        Sid      = ""
                    },
                    # (1 unchanged element hidden)
                ]
                # (1 unchanged element hidden)
            }
        )
        tags      = {}
        # (4 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret.app_token will be destroyed
  - resource "aws_secretsmanager_secret" "app_token" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH" -> null
      - name                           = "app-token-144676" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret.opsgenie_key will be destroyed
  - resource "aws_secretsmanager_secret" "opsgenie_key" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:opsgenie-key-144676-vBx1r2" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:opsgenie-key-144676-vBx1r2" -> null
      - name                           = "opsgenie-key-144676" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret.pickle_string will be destroyed
  - resource "aws_secretsmanager_secret" "pickle_string" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51" -> null
      - name                           = "pickle-string-144676" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret.slack_token will be destroyed
  - resource "aws_secretsmanager_secret" "slack_token" {
      - arn                            = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH" -> null
      - force_overwrite_replica_secret = false -> null
      - id                             = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH" -> null
      - name                           = "slack-token-144676" -> null
      - recovery_window_in_days        = 30 -> null
      - rotation_enabled               = false -> null
      - tags                           = {} -> null
      - tags_all                       = {} -> null
    }

  # aws_secretsmanager_secret_version.app_token will be destroyed
  - resource "aws_secretsmanager_secret_version" "app_token" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH|C5E20288-535F-408E-B6DF-13BD02F3143A" -> null
      - secret_binary  = (sensitive value)
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:app-token-144676-llkKEH" -> null
      - secret_string  = (sensitive value)
      - version_id     = "C5E20288-535F-408E-B6DF-13BD02F3143A" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_secretsmanager_secret_version.opsgenie_key will be destroyed
  - resource "aws_secretsmanager_secret_version" "opsgenie_key" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:opsgenie-key-144676-vBx1r2" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:opsgenie-key-144676-vBx1r2|E74FA7AF-6BFB-4D08-BFD3-2BD87ACC45B2" -> null
      - secret_binary  = (sensitive value)
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:opsgenie-key-144676-vBx1r2" -> null
      - secret_string  = (sensitive value)
      - version_id     = "E74FA7AF-6BFB-4D08-BFD3-2BD87ACC45B2" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_secretsmanager_secret_version.pickle_string will be destroyed
  - resource "aws_secretsmanager_secret_version" "pickle_string" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51|A118FAF4-24EE-4AA4-B37A-6ECE6F2493DA" -> null
      - secret_binary  = (sensitive value)
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:pickle-string-144676-0zJs51" -> null
      - secret_string  = (sensitive value)
      - version_id     = "A118FAF4-24EE-4AA4-B37A-6ECE6F2493DA" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # aws_secretsmanager_secret_version.slack_token will be destroyed
  - resource "aws_secretsmanager_secret_version" "slack_token" {
      - arn            = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH" -> null
      - id             = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH|DADF5CF7-58C2-4FE5-BA5F-F3230E796DA0" -> null
      - secret_binary  = (sensitive value)
      - secret_id      = "arn:aws:secretsmanager:ca-central-1:283582579564:secret:slack-token-144676-Nnw4ZH" -> null
      - secret_string  = (sensitive value)
      - version_id     = "DADF5CF7-58C2-4FE5-BA5F-F3230E796DA0" -> null
      - version_stages = [
          - "AWSCURRENT",
        ] -> null
    }

  # random_string.random will be destroyed
  - resource "random_string" "random" {
      - id          = "144676" -> null
      - length      = 6 -> null
      - lower       = true -> null
      - min_lower   = 0 -> null
      - min_numeric = 0 -> null
      - min_special = 0 -> null
      - min_upper   = 0 -> null
      - number      = true -> null
      - result      = "144676" -> null
      - special     = false -> null
      - upper       = false -> null
    }

Plan: 1 to add, 2 to change, 10 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_log_group.sre-bot_group"]
WARN - plan.json - main - Missing Common Tags: ["aws_dynamodb_table.webhooks_table"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecr_repository.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_cluster.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_service.main"]
WARN - plan.json - main - Missing Common Tags: ["aws_ecs_task_definition.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.sre-bot_secrets_manager"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.sre-bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.sre_bot_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_health_check.sre_bot_healthcheck"]
WARN - plan.json - main - Missing Common Tags: ["aws_route53_zone.sre_bot"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ecs_tasks"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.sre_bot_load_balancer"]
WARN - plan.json - main - Missing Common Tags: ["module.attach_tf_plan_policy.aws_iam_policy.this"]

34 tests, 17 passed, 17 warnings, 0 failures, 0 exceptions

```

</details>
